cask_args appdir: "/Applications"
cask_args fontdir: "/Library/Fonts"

# Tap Homebrew
tap "buo/cask-upgrade"
tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"
tap "ddev/ddev"
tap "ferdium/ferdium"
tap "getantibody/tap"
tap "homebrew/cask-drivers"
tap "homebrew/services"
tap "oven-sh/bun"
tap "remotemobprogramming/brew"

# System
brew "mas" # mac app store formular
brew "zsh"
brew "node"
brew "curl"
brew "wget"
brew "git"
brew "openssl"
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "binutils"
brew "blueutil"
brew "coreutils"
brew "ctags"
brew "curl"
brew "deno"
brew "adr-tools"
brew "congstar/devops-tools/bcorpclient"
brew "reattach-to-user-namespace"
brew "watchman"
brew "yarn"
brew "zsh"
brew "gradle"
brew "zsh-completions"
brew "hub"
brew "rbenv"
brew "jq"
brew "jo"
brew "remotemobprogramming/brew/mob"
brew "pnpm"

# fonts
brew "font-consolas-for-powerline"
brew "font-fira-code"
brew "font-roboto-mono"
brew "font-roboto-mono-for-powerline"
brew "font-inconsolata"
brew "font-menlo-for-powerline"
brew "font-fira-mono-for-powerline"

cask "1password"
cask "1password-cli"
cask "alfred", args: { fontdir: "/Library/Fonts" }
cask "alt-tab", args: { fontdir: "/Library/Fonts" }
cask "amazon-q", args: { fontdir: "/Library/Fonts" }
cask "arc"
cask "background-music"
cask "bartender", args: { fontdir: "/Library/Fonts" }
cask "cakebrew"
cask "cameracontroller"
cask "chromium"
cask "diffmerge"
cask "docker"
cask "fantastical"
cask "figma"
cask "firefox"
cask "font-hack-nerd-font", args: { fontdir: "/Library/Fonts" }
cask "fontgoggles"
cask "github"
cask "google-chrome", args: { fontdir: "/Library/Fonts" }
cask "google-chrome@canary"
cask "hyperswitch", args: { fontdir: "/Library/Fonts" }
cask "iterm2", args: { fontdir: "/Library/Fonts" }
cask "keka", args: { fontdir: "/Library/Fonts" }
cask "keycastr"
cask "local"
cask "mattermost", args: { fontdir: "/Library/Fonts" }
cask "microsoft-teams"
cask "miro"
cask "monitorcontrol", args: { fontdir: "/Library/Fonts" }
cask "netspot"
cask "notion"
cask "onyx"
cask "openlens"
cask "openvpn-connect"
cask "postman"
cask "rectangle", args: { fontdir: "/Library/Fonts" }
cask "shottr"
cask "slack"
cask "tabby"
cask "tower", args: { fontdir: "/Library/Fonts" }
cask "tweetbot", args: { fontdir: "/Library/Fonts" }
cask "typora"
cask "utm"
cask "visual-studio-code", args: { fontdir: "/Library/Fonts" }
cask "vlc"
cask "warp"
cask "zoom"
vscode "adobe.xd"
vscode "akamud.vscode-theme-onedark"
vscode "alefragnani.project-manager"
vscode "alexdima.vscode-lcov"
vscode "amazonwebservices.codewhisperer-for-command-line-companion"
vscode "andrew-codes.cypress-snippets"
vscode "andys8.jest-snippets"
vscode "ankitcode.firefly"
vscode "anteprimorac.html-end-tag-labels"
vscode "astro-build.astro-vscode"
vscode "astro-build.houston"
vscode "barrsan.reui"
vscode "beardedbear.beardedicons"
vscode "benjaminbenais.copilot-theme"
vscode "benjaminkott.typo3-typoscript"
vscode "better-ts-errors.better-ts-errors"
vscode "bradlc.vscode-tailwindcss"
vscode "capaj.graphql-codegen-vscode"
vscode "catstarwind.filesync"
vscode "christian-kohler.npm-intellisense"
vscode "christian-kohler.path-intellisense"
vscode "cpylua.language-postcss"
vscode "cstuder.gitlab-ci-validator"
vscode "dart-code.dart-code"
vscode "dbaeumer.vscode-eslint"
vscode "dcortes92.freemarker"
vscode "dennisvash.summer-time"
vscode "dionmunk.vscode-notes"
vscode "dracula-theme.theme-dracula"
vscode "dsznajder.es7-react-js-snippets"
vscode "eamodio.gitlens"
vscode "editorconfig.editorconfig"
vscode "eliostruyf.vscode-front-matter"
vscode "eliverlara.andromeda"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "fabiospampinato.vscode-terminals"
vscode "felipecaputo.git-project-manager"
vscode "figma.figma-vscode-extension"
vscode "file-icons.file-icons"
vscode "firsttris.vscode-jest-runner"
vscode "formulahendry.auto-rename-tag"
vscode "formulahendry.docker-explorer"
vscode "fwcd.kotlin"
vscode "gamunu.vscode-yarn"
vscode "gencer.html-slim-scss-css-class-completion"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.github-vscode-theme"
vscode "gitlab.gitlab-workflow"
vscode "graphql.vscode-graphql"
vscode "graphql.vscode-graphql-execution"
vscode "graphql.vscode-graphql-syntax"
vscode "gruntfuggly.todo-tree"
vscode "hbenl.vscode-test-explorer"
vscode "hediet.vscode-drawio"
vscode "idered.figma"
vscode "infeng.vscode-react-typescript"
vscode "jacano.vscode-pnpm"
vscode "jakob101.relativepath"
vscode "jock.svg"
vscode "josef.rouge-theme"
vscode "josefbiehler.cypress-fixture-intellisense"
vscode "jspolancor.presentationmode"
vscode "kingwl.vscode-vitest-runner"
vscode "kumar-harsh.graphql-for-vscode"
vscode "liviuschera.noctis"
vscode "marqu3s.aurora-x"
vscode "mathiasfrohlich.kotlin"
vscode "mgmcdermott.vscode-language-babel"
vscode "mikestead.dotenv"
vscode "monokai.theme-monokai-pro-vscode"
vscode "mrmlnc.vscode-scss"
vscode "ms-azuretools.vscode-docker"
vscode "ms-ceintl.vscode-language-pack-de"
vscode "ms-playwright.playwright"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.live-server"
vscode "ms-vscode.remote-explorer"
vscode "ms-vscode.test-adapter-converter"
vscode "ms-vsliveshare.vsliveshare"
vscode "msjsdiag.vscode-react-native"
vscode "natizyskunk.sftp"
vscode "nrwl.angular-console"
vscode "oderwat.indent-rainbow"
vscode "orta.vscode-jest"
vscode "pkief.material-icon-theme"
vscode "pmneo.tsimporter"
vscode "redhat.java"
vscode "redhat.vscode-yaml"
vscode "richie5um2.vscode-sort-json"
vscode "ryanluker.vscode-coverage-gutters"
vscode "sdras.night-owl"
vscode "shelex.vscode-cy-helper"
vscode "simonsiefke.svg-preview"
vscode "sooxt.pretty-graphql"
vscode "streetsidesoftware.code-spell-checker"
vscode "styled-components.vscode-styled-components"
vscode "svelte.svelte-vscode"
vscode "tal7aouy.icons"
vscode "teabyii.ayu"
vscode "techer.open-in-browser"
vscode "tnrich.vscode-extension-open-cypress"
vscode "trabpukcip.vscode-npm-scripts"
vscode "tyriar.lorem-ipsum"
vscode "tyriar.sort-lines"
vscode "unifiedjs.vscode-mdx"
vscode "usernamehw.errorlens"
vscode "vadymbiliuk.ts-react-snippets"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vitaliymaz.vscode-svg-previewer"
vscode "vitest.explorer"
vscode "vivaxy.vscode-conventional-commits"
vscode "vscjava.vscode-gradle"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "vscode-ext.sync-rsync"
vscode "vscode-icons-team.vscode-icons"
vscode "vunguyentuan.vscode-css-variables"
vscode "waderyan.gitblame"
vscode "wallabyjs.quokka-vscode"
vscode "wallabyjs.wallaby-vscode"
vscode "whizkydee.material-palenight-theme"
vscode "willi84.vikings-icon-theme"
vscode "wix.glean"
vscode "wix.vscode-import-cost"
vscode "xabikos.javascriptsnippets"
vscode "yoavbls.pretty-ts-errors"
vscode "zhouronghui.propertylist"
vscode "zhuangtongfa.material-theme"



