cask_args appdir: "/Applications"
cask_args fontdir: "/Library/Fonts"

# Tap Homebrew
tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"
tap "homebrew/cask-fonts"

# System
brew "mas" # mac app store formular
brew "zsh"
brew "node"
brew "curl"
brew "wget"
brew "git"
brew "openssl"
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "binutils"
brew "blueutil"
brew "coreutils"
brew "ctags"
brew "curl"
brew "deno"
brew "adr-tools"
brew "congstar/devops-tools/bcorpclient"
brew "reattach-to-user-namespace"
brew "watchman"
brew "yarn"
brew "zsh"
brew "gradle"
brew "zsh-completions"
brew "hub"
brew "php@7.2"
brew "pipenv"
brew "rbenv"
brew "remotemobprogramming/brew/mob"
brew "pnpm"

# fonts
brew "font-consolas-for-powerline"
brew "font-fira-code"
brew "font-roboto-mono"
brew "font-roboto-mono-for-powerline"
brew "font-inconsolata"
brew "font-menlo-for-powerline"
brew "font-fira-mono-for-powerline"

cask "visual-studio-code"
cask "rectangle"
cask "alfred"
cask "warp"
cask "bartender"
cask "monitorcontrol"
cask "mattermost"
cask "google-chrome"
cask "openvpn-connect"
cask "alt-tab"
cask "keka"
cask "tweetbot"
cask "meeter"
cask "font-hack-nerd-font"
cask "shottr"
cask "aldente"
cask "microsoft-teams"
cask "local"
cask "figma"
cask "orion"
cask "firefox"
cask "alt-tab"
cask "postman"
cask "forklift"
cask "rambox"
cask "miro"
cask "handbrake"
cask "cakebrew"
cask "onyx"
cask "slack"
cask "diffmerge"
cask "zoomus"

brew "jq"
brew "jo"

