cask_args appdir: "/Applications"
cask_args fontdir: "/Library/Fonts"

# Tap Homebrew
tap "getantibody/tap"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-fonts"
tap "homebrew/cask-versions"
tap "homebrew/core"
tap "homebrew/services"

# System
brew "mas" # mac app store formular
brew "zsh"
brew "node"
brew "curl"
brew "wget"
brew "git"
brew "openssl"
brew "coreutils"
brew "moreutils"
brew "findutils"
brew "binutils"
brew "blueutil"
brew "coreutils"
brew "ctags"
brew "curl"
brew "deno"
brew "adr-tools"
brew "congstar/devops-tools/bcorpclient"
brew "reattach-to-user-namespace"
brew "watchman"
brew "yarn"
brew "zsh"
brew "gradle"
brew "zsh-completions"
brew "httpd", restart_service: true
brew "hub"
brew "php@7.2"
brew "pipenv"
brew "rbenv"
brew "remotemobprogramming/brew/mob"

# fonts
brew "font-consolas-for-powerline"
brew "font-fira-code"
brew "font-roboto-mono"
brew "font-roboto-mono-for-powerline"
brew "font-inconsolata"
brew "font-menlo-for-powerline"
brew "font-fira-mono-for-powerline"

cask "visual-studio-code"
cask "rectangle"
cask "alfred"
cask "tower"
cask "1password"
cask "iterm2"
cask "bartender"
cask "monitorcontrol"
cask "mattermost"
cask "google-chrome"
cask "openvpn-connect"
cask "tunnelblick"
cask "alt-tab"
cask "hyperswitch"
cask "keka"
cask "tweetbot"
cask "meeter"

cask "zoomus"

brew "jq"
brew "jo"

brew "yarn"

# App Store
mas "Adobe Lightroom", id: 1451544217
mas "Amphetamine", id: 937984704
mas "Cardhop", id: 1290358394
mas "Fantastical", id: 975937182
mas "Monosnap", id: 540348655